; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-5-3-8)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	s10 - location
	p0-3 - location
	p0-8 - location
	p1-5 - location
	p1-10 - location
	p2-3 - location
	p3-1 - location
	p3-4 - location
	p3-10 - location
	p4-2 - location
	p4-5 - location
	p4-7 - location
	p4-8 - location
	p5-6 - location
	p7-0 - location
	p7-8 - location
	p8-1 - location
	p8-2 - location
	p8-5 - location
	p9-0 - location
	p9-6 - location
	p10-9 - location
	)
	(:init
	(at driver1 s5)
	(at driver2 s3)
	(at driver3 s9)
	(at driver4 s4)
	(at driver5 s1)
	(at truck1 s8)
	(empty truck1)
	(at truck2 s0)
	(empty truck2)
	(at truck3 s7)
	(empty truck3)
	(at package1 s4)
	(at package2 s0)
	(at package3 s7)
	(at package4 s5)
	(at package5 s2)
	(at package6 s4)
	(at package7 s10)
	(at package8 s5)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(= (time-to-walk s0 p0-3) 8)
	(= (time-to-walk p0-3 s0) 8)
	(= (time-to-walk s3 p0-3) 96)
	(= (time-to-walk p0-3 s3) 96)
	(path s0 p0-8)
	(path p0-8 s0)
	(path s8 p0-8)
	(path p0-8 s8)
	(= (time-to-walk s0 p0-8) 97)
	(= (time-to-walk p0-8 s0) 97)
	(= (time-to-walk s8 p0-8) 13)
	(= (time-to-walk p0-8 s8) 13)
	(path s1 p1-5)
	(path p1-5 s1)
	(path s5 p1-5)
	(path p1-5 s5)
	(= (time-to-walk s1 p1-5) 60)
	(= (time-to-walk p1-5 s1) 60)
	(= (time-to-walk s5 p1-5) 8)
	(= (time-to-walk p1-5 s5) 8)
	(path s1 p1-10)
	(path p1-10 s1)
	(path s10 p1-10)
	(path p1-10 s10)
	(= (time-to-walk s1 p1-10) 66)
	(= (time-to-walk p1-10 s1) 66)
	(= (time-to-walk s10 p1-10) 99)
	(= (time-to-walk p1-10 s10) 99)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(= (time-to-walk s2 p2-3) 81)
	(= (time-to-walk p2-3 s2) 81)
	(= (time-to-walk s3 p2-3) 61)
	(= (time-to-walk p2-3 s3) 61)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(= (time-to-walk s3 p3-1) 100)
	(= (time-to-walk p3-1 s3) 100)
	(= (time-to-walk s1 p3-1) 70)
	(= (time-to-walk p3-1 s1) 70)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(= (time-to-walk s3 p3-4) 86)
	(= (time-to-walk p3-4 s3) 86)
	(= (time-to-walk s4 p3-4) 66)
	(= (time-to-walk p3-4 s4) 66)
	(path s3 p3-10)
	(path p3-10 s3)
	(path s10 p3-10)
	(path p3-10 s10)
	(= (time-to-walk s3 p3-10) 11)
	(= (time-to-walk p3-10 s3) 11)
	(= (time-to-walk s10 p3-10) 46)
	(= (time-to-walk p3-10 s10) 46)
	(path s4 p4-2)
	(path p4-2 s4)
	(path s2 p4-2)
	(path p4-2 s2)
	(= (time-to-walk s4 p4-2) 19)
	(= (time-to-walk p4-2 s4) 19)
	(= (time-to-walk s2 p4-2) 79)
	(= (time-to-walk p4-2 s2) 79)
	(path s4 p4-5)
	(path p4-5 s4)
	(path s5 p4-5)
	(path p4-5 s5)
	(= (time-to-walk s4 p4-5) 68)
	(= (time-to-walk p4-5 s4) 68)
	(= (time-to-walk s5 p4-5) 43)
	(= (time-to-walk p4-5 s5) 43)
	(path s4 p4-7)
	(path p4-7 s4)
	(path s7 p4-7)
	(path p4-7 s7)
	(= (time-to-walk s4 p4-7) 34)
	(= (time-to-walk p4-7 s4) 34)
	(= (time-to-walk s7 p4-7) 89)
	(= (time-to-walk p4-7 s7) 89)
	(path s4 p4-8)
	(path p4-8 s4)
	(path s8 p4-8)
	(path p4-8 s8)
	(= (time-to-walk s4 p4-8) 89)
	(= (time-to-walk p4-8 s4) 89)
	(= (time-to-walk s8 p4-8) 32)
	(= (time-to-walk p4-8 s8) 32)
	(path s5 p5-6)
	(path p5-6 s5)
	(path s6 p5-6)
	(path p5-6 s6)
	(= (time-to-walk s5 p5-6) 8)
	(= (time-to-walk p5-6 s5) 8)
	(= (time-to-walk s6 p5-6) 80)
	(= (time-to-walk p5-6 s6) 80)
	(path s7 p7-0)
	(path p7-0 s7)
	(path s0 p7-0)
	(path p7-0 s0)
	(= (time-to-walk s7 p7-0) 41)
	(= (time-to-walk p7-0 s7) 41)
	(= (time-to-walk s0 p7-0) 18)
	(= (time-to-walk p7-0 s0) 18)
	(path s7 p7-8)
	(path p7-8 s7)
	(path s8 p7-8)
	(path p7-8 s8)
	(= (time-to-walk s7 p7-8) 30)
	(= (time-to-walk p7-8 s7) 30)
	(= (time-to-walk s8 p7-8) 29)
	(= (time-to-walk p7-8 s8) 29)
	(path s8 p8-1)
	(path p8-1 s8)
	(path s1 p8-1)
	(path p8-1 s1)
	(= (time-to-walk s8 p8-1) 31)
	(= (time-to-walk p8-1 s8) 31)
	(= (time-to-walk s1 p8-1) 37)
	(= (time-to-walk p8-1 s1) 37)
	(path s8 p8-2)
	(path p8-2 s8)
	(path s2 p8-2)
	(path p8-2 s2)
	(= (time-to-walk s8 p8-2) 25)
	(= (time-to-walk p8-2 s8) 25)
	(= (time-to-walk s2 p8-2) 27)
	(= (time-to-walk p8-2 s2) 27)
	(path s8 p8-5)
	(path p8-5 s8)
	(path s5 p8-5)
	(path p8-5 s5)
	(= (time-to-walk s8 p8-5) 50)
	(= (time-to-walk p8-5 s8) 50)
	(= (time-to-walk s5 p8-5) 84)
	(= (time-to-walk p8-5 s5) 84)
	(path s9 p9-0)
	(path p9-0 s9)
	(path s0 p9-0)
	(path p9-0 s0)
	(= (time-to-walk s9 p9-0) 35)
	(= (time-to-walk p9-0 s9) 35)
	(= (time-to-walk s0 p9-0) 15)
	(= (time-to-walk p9-0 s0) 15)
	(path s9 p9-6)
	(path p9-6 s9)
	(path s6 p9-6)
	(path p9-6 s6)
	(= (time-to-walk s9 p9-6) 83)
	(= (time-to-walk p9-6 s9) 83)
	(= (time-to-walk s6 p9-6) 15)
	(= (time-to-walk p9-6 s6) 15)
	(path s10 p10-9)
	(path p10-9 s10)
	(path s9 p10-9)
	(path p10-9 s9)
	(= (time-to-walk s10 p10-9) 75)
	(= (time-to-walk p10-9 s10) 75)
	(= (time-to-walk s9 p10-9) 83)
	(= (time-to-walk p10-9 s9) 83)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 85)
	(= (time-to-drive s1 s0) 85)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 61)
	(= (time-to-drive s2 s0) 61)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 48)
	(= (time-to-drive s1 s2) 48)
	(link s2 s6)
	(link s6 s2)
	(= (time-to-drive s2 s6) 95)
	(= (time-to-drive s6 s2) 95)
	(link s2 s9)
	(link s9 s2)
	(= (time-to-drive s2 s9) 6)
	(= (time-to-drive s9 s2) 6)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 67)
	(= (time-to-drive s0 s3) 67)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 73)
	(= (time-to-drive s1 s3) 73)
	(link s3 s10)
	(link s10 s3)
	(= (time-to-drive s3 s10) 74)
	(= (time-to-drive s10 s3) 74)
	(link s4 s6)
	(link s6 s4)
	(= (time-to-drive s4 s6) 9)
	(= (time-to-drive s6 s4) 9)
	(link s5 s0)
	(link s0 s5)
	(= (time-to-drive s5 s0) 7)
	(= (time-to-drive s0 s5) 7)
	(link s5 s2)
	(link s2 s5)
	(= (time-to-drive s5 s2) 62)
	(= (time-to-drive s2 s5) 62)
	(link s5 s3)
	(link s3 s5)
	(= (time-to-drive s5 s3) 97)
	(= (time-to-drive s3 s5) 97)
	(link s5 s8)
	(link s8 s5)
	(= (time-to-drive s5 s8) 38)
	(= (time-to-drive s8 s5) 38)
	(link s6 s0)
	(link s0 s6)
	(= (time-to-drive s6 s0) 69)
	(= (time-to-drive s0 s6) 69)
	(link s6 s1)
	(link s1 s6)
	(= (time-to-drive s6 s1) 77)
	(= (time-to-drive s1 s6) 77)
	(link s6 s3)
	(link s3 s6)
	(= (time-to-drive s6 s3) 79)
	(= (time-to-drive s3 s6) 79)
	(link s6 s7)
	(link s7 s6)
	(= (time-to-drive s6 s7) 86)
	(= (time-to-drive s7 s6) 86)
	(link s6 s8)
	(link s8 s6)
	(= (time-to-drive s6 s8) 6)
	(= (time-to-drive s8 s6) 6)
	(link s6 s9)
	(link s9 s6)
	(= (time-to-drive s6 s9) 8)
	(= (time-to-drive s9 s6) 8)
	(link s6 s10)
	(link s10 s6)
	(= (time-to-drive s6 s10) 17)
	(= (time-to-drive s10 s6) 17)
	(link s7 s1)
	(link s1 s7)
	(= (time-to-drive s7 s1) 43)
	(= (time-to-drive s1 s7) 43)
	(link s7 s2)
	(link s2 s7)
	(= (time-to-drive s7 s2) 32)
	(= (time-to-drive s2 s7) 32)
	(link s7 s5)
	(link s5 s7)
	(= (time-to-drive s7 s5) 43)
	(= (time-to-drive s5 s7) 43)
	(link s7 s8)
	(link s8 s7)
	(= (time-to-drive s7 s8) 92)
	(= (time-to-drive s8 s7) 92)
	(link s7 s10)
	(link s10 s7)
	(= (time-to-drive s7 s10) 16)
	(= (time-to-drive s10 s7) 16)
	(link s8 s2)
	(link s2 s8)
	(= (time-to-drive s8 s2) 78)
	(= (time-to-drive s2 s8) 78)
	(link s8 s4)
	(link s4 s8)
	(= (time-to-drive s8 s4) 7)
	(= (time-to-drive s4 s8) 7)
	(link s8 s9)
	(link s9 s8)
	(= (time-to-drive s8 s9) 98)
	(= (time-to-drive s9 s8) 98)
	(link s9 s1)
	(link s1 s9)
	(= (time-to-drive s9 s1) 93)
	(= (time-to-drive s1 s9) 93)
	(link s9 s3)
	(link s3 s9)
	(= (time-to-drive s9 s3) 82)
	(= (time-to-drive s3 s9) 82)
	(link s9 s10)
	(link s10 s9)
	(= (time-to-drive s9 s10) 80)
	(= (time-to-drive s10 s9) 80)
	(link s10 s1)
	(link s1 s10)
	(= (time-to-drive s10 s1) 77)
	(= (time-to-drive s1 s10) 77)
	(link s10 s8)
	(link s8 s10)
	(= (time-to-drive s10 s8) 42)
	(= (time-to-drive s8 s10) 42)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver1 s3)
	(at driver2 s6)
	(at driver4 s10)
	(at driver5 s9)
	(at truck1 s0)
	(at truck3 s1)
	(at package1 s7)
	(at package2 s9)
	(at package3 s4)
	(at package4 s7)
	(at package5 s6)
	(at package6 s10)
	(at package7 s1)
	(at package8 s9)
	))

(:metric minimize (+ (+ (* 2  (total-time)) (* 3  (driven))) (* 2  (walked))))

)

; plan
1. (walk driver5 s1 p8-1)
   deleted: (at driver5 s1)
   added: (at driver5 p8-1)
   changed: (walked) from 0 to 37
   goals met: 0 of 14
2. (walk driver5 p8-1 s8)
   deleted: (at driver5 p8-1)
   added: (at driver5 s8)
   changed: (walked) from 37 to 68
   goals met: 0 of 14
3. (board-truck driver5 truck1 s8)
   deleted: (at driver5 s8) (empty truck1)
   added: (driving driver5 truck1)
   goals met: 0 of 14
4. (drive-truck truck1 s8 s6 driver5)
   deleted: (at truck1 s8)
   added: (at truck1 s6)
   changed: (driven) from 0 to 6
   goals met: 0 of 14
5. (walk driver1 s5 p1-5)
   deleted: (at driver1 s5)
   added: (at driver1 p1-5)
   changed: (walked) from 68 to 76
   goals met: 0 of 14
6. (walk driver1 p1-5 s1)
   deleted: (at driver1 p1-5)
   added: (at driver1 s1)
   changed: (walked) from 76 to 136
   goals met: 0 of 14
7. (walk driver1 s1 p3-1)
   deleted: (at driver1 s1)
   added: (at driver1 p3-1)
   changed: (walked) from 136 to 206
   goals met: 0 of 14
8. (walk driver1 p3-1 s3)
   deleted: (at driver1 p3-1)
   added: (at driver1 s3)
   changed: (walked) from 206 to 306
   goals met: 1 of 14
9. (drive-truck truck1 s6 s1 driver5)
   deleted: (at truck1 s6)
   added: (at truck1 s1)
   changed: (driven) from 6 to 83
   goals met: 1 of 14
10. (walk driver4 s4 p3-4)
   deleted: (at driver4 s4)
   added: (at driver4 p3-4)
   changed: (walked) from 306 to 372
   goals met: 1 of 14
11. (walk driver4 p3-4 s3)
   deleted: (at driver4 p3-4)
   added: (at driver4 s3)
   changed: (walked) from 372 to 458
   goals met: 1 of 14
12. (walk driver4 s3 p3-10)
   deleted: (at driver4 s3)
   added: (at driver4 p3-10)
   changed: (walked) from 458 to 469
   goals met: 1 of 14
13. (walk driver4 p3-10 s10)
   deleted: (at driver4 p3-10)
   added: (at driver4 s10)
   changed: (walked) from 469 to 515
   goals met: 2 of 14
14. (drive-truck truck1 s1 s7 driver5)
   deleted: (at truck1 s1)
   added: (at truck1 s7)
   changed: (driven) from 83 to 126
   goals met: 2 of 14
15. (walk driver2 s3 p3-10)
   deleted: (at driver2 s3)
   added: (at driver2 p3-10)
   changed: (walked) from 515 to 526
   goals met: 2 of 14
16. (walk driver2 p3-10 s10)
   deleted: (at driver2 p3-10)
   added: (at driver2 s10)
   changed: (walked) from 526 to 572
   goals met: 2 of 14
17. (load-truck package3 truck1 s7)
   deleted: (at package3 s7)
   added: (in package3 truck1)
   goals met: 2 of 14
18. (drive-truck truck1 s7 s10 driver5)
   deleted: (at truck1 s7)
   added: (at truck1 s10)
   changed: (driven) from 126 to 142
   goals met: 2 of 14
19. (load-truck package7 truck1 s10)
   deleted: (at package7 s10)
   added: (in package7 truck1)
   goals met: 2 of 14
20. (drive-truck truck1 s10 s1 driver5)
   deleted: (at truck1 s10)
   added: (at truck1 s1)
   changed: (driven) from 142 to 219
   goals met: 2 of 14
21. (unload-truck package7 truck1 s1)
   deleted: (in package7 truck1)
   added: (at package7 s1)
   goals met: 3 of 14
22. (drive-truck truck1 s1 s0 driver5)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   changed: (driven) from 219 to 304
   goals met: 4 of 14
23. (load-truck package2 truck1 s0)
   deleted: (at package2 s0)
   added: (in package2 truck1)
   goals met: 4 of 14
24. (walk driver2 s10 p10-9)
   deleted: (at driver2 s10)
   added: (at driver2 p10-9)
   changed: (walked) from 572 to 647
   goals met: 4 of 14
25. (walk driver2 p10-9 s9)
   deleted: (at driver2 p10-9)
   added: (at driver2 s9)
   changed: (walked) from 647 to 730
   goals met: 4 of 14
26. (walk driver2 s9 p9-6)
   deleted: (at driver2 s9)
   added: (at driver2 p9-6)
   changed: (walked) from 730 to 813
   goals met: 4 of 14
27. (walk driver2 p9-6 s6)
   deleted: (at driver2 p9-6)
   added: (at driver2 s6)
   changed: (walked) from 813 to 828
   goals met: 5 of 14
28. (drive-truck truck1 s0 s5 driver5)
   deleted: (at truck1 s0)
   added: (at truck1 s5)
   changed: (driven) from 304 to 311
   goals met: 4 of 14
29. (load-truck package8 truck1 s5)
   deleted: (at package8 s5)
   added: (in package8 truck1)
   goals met: 4 of 14
30. (load-truck package4 truck1 s5)
   deleted: (at package4 s5)
   added: (in package4 truck1)
   goals met: 4 of 14
31. (drive-truck truck1 s5 s7 driver5)
   deleted: (at truck1 s5)
   added: (at truck1 s7)
   changed: (driven) from 311 to 354
   goals met: 4 of 14
32. (unload-truck package4 truck1 s7)
   deleted: (in package4 truck1)
   added: (at package4 s7)
   goals met: 5 of 14
33. (drive-truck truck1 s7 s2 driver5)
   deleted: (at truck1 s7)
   added: (at truck1 s2)
   changed: (driven) from 354 to 386
   goals met: 5 of 14
34. (load-truck package5 truck1 s2)
   deleted: (at package5 s2)
   added: (in package5 truck1)
   goals met: 5 of 14
35. (drive-truck truck1 s2 s6 driver5)
   deleted: (at truck1 s2)
   added: (at truck1 s6)
   changed: (driven) from 386 to 481
   goals met: 5 of 14
36. (unload-truck package5 truck1 s6)
   deleted: (in package5 truck1)
   added: (at package5 s6)
   goals met: 6 of 14
37. (drive-truck truck1 s6 s9 driver5)
   deleted: (at truck1 s6)
   added: (at truck1 s9)
   changed: (driven) from 481 to 489
   goals met: 6 of 14
38. (unload-truck package2 truck1 s9)
   deleted: (in package2 truck1)
   added: (at package2 s9)
   goals met: 7 of 14
39. (drive-truck truck1 s9 s8 driver5)
   deleted: (at truck1 s9)
   added: (at truck1 s8)
   changed: (driven) from 489 to 587
   goals met: 7 of 14
40. (drive-truck truck1 s8 s4 driver5)
   deleted: (at truck1 s8)
   added: (at truck1 s4)
   changed: (driven) from 587 to 594
   goals met: 7 of 14
41. (unload-truck package3 truck1 s4)
   deleted: (in package3 truck1)
   added: (at package3 s4)
   goals met: 8 of 14
42. (load-truck package1 truck1 s4)
   deleted: (at package1 s4)
   added: (in package1 truck1)
   goals met: 8 of 14
43. (load-truck package6 truck1 s4)
   deleted: (at package6 s4)
   added: (in package6 truck1)
   goals met: 8 of 14
44. (drive-truck truck1 s4 s6 driver5)
   deleted: (at truck1 s4)
   added: (at truck1 s6)
   changed: (driven) from 594 to 603
   goals met: 8 of 14
45. (drive-truck truck1 s6 s7 driver5)
   deleted: (at truck1 s6)
   added: (at truck1 s7)
   changed: (driven) from 603 to 689
   goals met: 8 of 14
46. (unload-truck package1 truck1 s7)
   deleted: (in package1 truck1)
   added: (at package1 s7)
   goals met: 9 of 14
47. (drive-truck truck1 s7 s10 driver5)
   deleted: (at truck1 s7)
   added: (at truck1 s10)
   changed: (driven) from 689 to 705
   goals met: 9 of 14
48. (unload-truck package6 truck1 s10)
   deleted: (in package6 truck1)
   added: (at package6 s10)
   goals met: 10 of 14
49. (drive-truck truck1 s10 s9 driver5)
   deleted: (at truck1 s10)
   added: (at truck1 s9)
   changed: (driven) from 705 to 785
   goals met: 10 of 14
50. (unload-truck package8 truck1 s9)
   deleted: (in package8 truck1)
   added: (at package8 s9)
   goals met: 11 of 14
51. (disembark-truck driver5 truck1 s9)
   deleted: (driving driver5 truck1)
   added: (at driver5 s9) (empty truck1)
   goals met: 12 of 14
52. (walk driver5 s9 p9-0)
   deleted: (at driver5 s9)
   added: (at driver5 p9-0)
   changed: (walked) from 828 to 863
   goals met: 11 of 14
53. (board-truck driver3 truck1 s9)
   deleted: (at driver3 s9) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 11 of 14
54. (drive-truck truck1 s9 s1 driver3)
   deleted: (at truck1 s9)
   added: (at truck1 s1)
   changed: (driven) from 785 to 878
   goals met: 11 of 14
55. (walk driver5 p9-0 s9)
   deleted: (at driver5 p9-0)
   added: (at driver5 s9)
   changed: (walked) from 863 to 898
   goals met: 12 of 14
56. (drive-truck truck1 s1 s0 driver3)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   changed: (driven) from 878 to 963
   goals met: 13 of 14
57. (disembark-truck driver3 truck1 s0)
   deleted: (driving driver3 truck1)
   added: (at driver3 s0) (empty truck1)
   goals met: 13 of 14
58. (walk driver3 s0 p7-0)
   deleted: (at driver3 s0)
   added: (at driver3 p7-0)
   changed: (walked) from 898 to 916
   goals met: 13 of 14
59. (walk driver3 p7-0 s7)
   deleted: (at driver3 p7-0)
   added: (at driver3 s7)
   changed: (walked) from 916 to 957
   goals met: 13 of 14
60. (board-truck driver3 truck3 s7)
   deleted: (at driver3 s7) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 13 of 14
61. (drive-truck truck3 s7 s1 driver3)
   deleted: (at truck3 s7)
   added: (at truck3 s1)
   changed: (driven) from 963 to 1006
   goals met: 14 of 14
